tap "atlassian/acli"
tap "atomicjar/tap"
tap "confluentinc/tap"
tap "felixkratz/formulae"
tap "fluxcd/tap"
tap "kubeshop/botkube"
tap "nikitabobko/tap"
brew "tuckr"
brew "atuin"
brew "tree"
brew "neovim"
brew "antidote"
brew "zstd"
brew "ast-grep"
brew "openssl@3"
brew "awscli"
brew "ffmpeg"
brew "git-delta"
brew "jira-cli"
brew "just"
brew "kind"
brew "kubernetes-cli"
brew "stern"
brew "k9s"
brew "mise"
brew "ripgrep"
brew "snowflake-cli"
brew "tldr"
brew "tmux"
brew "starship"
brew "tree-sitter"
brew "trivy"
brew "watch"
brew "yazi"
brew "pet"
brew "bat"
brew "zoxide"
brew "eza"
brew "fzf"
brew "fd"
brew "jq"
brew "yq"
brew "wireguard-tools"
brew "atlassian/acli/acli"
brew "confluentinc/tap/cli"
brew "kubeshop/botkube/botkube"
cask "1password"
cask "1password-cli"
cask "claude-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "hammerspoon"
cask "orbstack"
cask "postman"
cask "slack"
cask "tana"
cask "atomicjar/tap/testcontainers-desktop"
cask "thaw"
cask "warp"
cask "daisydisk"
cask "firefox"
cask "keepingyouawake"
cask "zoom"
cask "visual-studio-code"
tap "grafana/grafana"
brew "grafana/grafana/gcx"
brew "helm"
