# ── Taps ──────────────────────────────────────────────────────────────────────
tap "atlassian/acli"
tap "atomicjar/tap"
tap "confluentinc/tap"
tap "felixkratz/formulae"
tap "fluxcd/tap"
tap "grafana/grafana"
tap "kubeshop/botkube"
tap "nikitabobko/tap"

# ── Shell & Terminal ───────────────────────────────────────────────────────────
brew "antidote"            # zsh plugin manager
brew "atuin"               # shell history
brew "starship"            # prompt
brew "tmux"                # terminal multiplexer
brew "tuckr"               # dotfiles symlink manager
brew "zoxide"              # smart cd
cask "ghostty"
cask "warp"

# ── Editors ────────────────────────────────────────────────────────────────────
brew "neovim"
brew "tree-sitter"
cask "visual-studio-code"

# ── CLI Utilities ──────────────────────────────────────────────────────────────
brew "mas"                 # Mac App Store CLI
brew "ast-grep"            # structural code search
brew "bat"                 # cat with syntax highlighting
brew "eza"                 # ls replacement
brew "fd"                  # find replacement
brew "ffmpeg"
brew "fzf"                 # fuzzy finder
brew "git-delta"           # diff pager
brew "jq"                  # JSON processor
brew "just"                # command runner
brew "mise"                # runtime version manager
brew "openssl@3"
brew "pet"                 # snippet manager
brew "ripgrep"             # grep replacement
brew "tldr"                # simplified man pages
brew "tree"
brew "watch"
brew "yazi"                # terminal file manager
brew "yq"                  # YAML/JSON processor
brew "zstd"                # compression

# ── Kubernetes & Cloud ─────────────────────────────────────────────────────────
brew "awscli"
brew "helm"
brew "jira-cli"
brew "kind"                # local k8s clusters
brew "kubernetes-cli"      # kubectl
brew "k9s"                 # k8s TUI
brew "snowflake-cli"
brew "stern"               # k8s log tailing
brew "trivy"               # vulnerability scanner
brew "wireguard-tools"
brew "atlassian/acli/acli"
brew "confluentinc/tap/cli"
brew "grafana/grafana/gcx"
brew "kubeshop/botkube/botkube"

# ── Fonts ──────────────────────────────────────────────────────────────────────
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"

# ── Apps ───────────────────────────────────────────────────────────────────────
cask "1password"
cask "1password-cli"
cask "atomicjar/tap/testcontainers-desktop"
cask "claude-code"
cask "daisydisk"
cask "firefox"
cask "hammerspoon"
cask "keepingyouawake"
cask "lulu"                # network firewall
cask "tailscale-app"
cask "orbstack"
cask "postman"
cask "slack"
cask "tana"
cask "thaw"
cask "zoom"

# ── Mac App Store ──────────────────────────────────────────────────────────────
mas "Pine Player", id: 1112075769
mas "The Unarchiver", id: 425424353
