# ── Taps ──────────────────────────────────────────────────────────────────────
tap "atlassian/acli"
tap "atomicjar/tap"
tap "confluentinc/tap"
tap "fluxcd/tap"
tap "grafana/grafana"
tap "aprilnea/tap"

# ── Shell & Terminal ───────────────────────────────────────────────────────────
brew "antidote"            # zsh plugin manager
brew "atuin"               # shell history
brew "starship"            # prompt
brew "tmux"                # terminal multiplexer
brew "tuckr"               # dotfiles symlink manager
brew "zoxide"              # smart cd
cask "ghostty"
cask "warp"

# ── Editors & IDEs ─────────────────────────────────────────────────────────────
brew "neovim"
brew "tree-sitter"
cask "cursor"
cask "datagrip"
cask "visual-studio-code"

# ── CLI Utilities ──────────────────────────────────────────────────────────────
brew "mas"                 # Mac App Store CLI
brew "ast-grep"            # structural code search
brew "bat"                 # cat with syntax highlighting
brew "eza"                 # ls replacement
brew "fd"                  # find replacement
brew "ffmpeg"
brew "fzf"                 # fuzzy finder
brew "git-delta"           # diff pager
brew "jq"                  # JSON processor
brew "just"                # command runner
brew "mise"                # runtime version manager
brew "openssl@3"
brew "pet"                 # snippet manager
brew "ripgrep"             # grep replacement
brew "tldr"                # simplified man pages
brew "tree"
brew "watch"
brew "yazi"                # terminal file manager
brew "yq"                  # YAML/JSON processor
brew "zstd"                # compression
brew "direnv"

# ── Kubernetes & Cloud ─────────────────────────────────────────────────────────
brew "awscli"
cask "gcloud-cli"          # Google Cloud SDK
brew "helm"
brew "jira-cli"
brew "kind"                # local k8s clusters
brew "kubernetes-cli"      # kubectl
brew "k9s"                 # k8s TUI
brew "snowflake-cli"
brew "stern"               # k8s log tailing
brew "trivy"               # vulnerability scanner
brew "wireguard-tools"
brew "atlassian/acli/acli"
brew "confluentinc/tap/cli"
brew "grafana/grafana/gcx"
cask "lens"                # Kubernetes GUI
cask "tableau"             # data visualization
cask "zui"                 # network packet analysis (successor to Brim)

# ── Fonts ──────────────────────────────────────────────────────────────────────
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"

# ── Browsers ───────────────────────────────────────────────────────────────────
cask "brave-browser"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "vivaldi"

# ── Communication ──────────────────────────────────────────────────────────────
cask "discord"
cask "loom"
cask "slack"
cask "telegram"
cask "zalo"
cask "zoom"

# ── Security & Privacy ─────────────────────────────────────────────────────────
cask "1password"
cask "1password-cli"
cask "lulu"                # network firewall
cask "proton-mail"
cask "protonvpn"

# ── AI ─────────────────────────────────────────────────────────────────────────
cask "chatgpt"
cask "claude-code"

# ── Productivity ───────────────────────────────────────────────────────────────
cask "obsidian"
cask "raycast"
cask "tana"
cask "zotero"
cask "wpsoffice"

# ── Utilities ──────────────────────────────────────────────────────────────────
cask "adobe-digital-editions"
cask "android-file-transfer"
cask "antigravity"
cask "aprilnea/tap/openlogi@latest"
cask "atomicjar/tap/testcontainers-desktop"
cask "bettershot"
cask "daisydisk"
cask "hammerspoon"
cask "httpie-desktop"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keymapp"             # ZSA keyboard configurator
cask "orbstack"
cask "postman"
cask "raspberry-pi-imager"
cask "rippling"
cask "tailscale-app"
cask "thaw"
cask "wireshark"

# ── Media ──────────────────────────────────────────────────────────────────────
cask "audacity"
cask "handbrake"

# ── Games ──────────────────────────────────────────────────────────────────────
cask "godot"
cask "steam"
cask "whisky"              # Wine wrapper for macOS

# ── Mac App Store ──────────────────────────────────────────────────────────────
mas "Pine Player", id: 1112075769
mas "The Unarchiver", id: 425424353
